backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 561]
      dtype: float32
      name: input
      sparse: false
    inbound_nodes: []
    name: input
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: fc_1
      trainable: true
      units: 512
      use_bias: true
    inbound_nodes:
    - - - input
        - 0
        - 0
        - {}
    name: fc_1
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: fc_2
      trainable: true
      units: 256
      use_bias: true
    inbound_nodes:
    - - - fc_1
        - 0
        - 0
        - {}
    name: fc_2
  - class_name: Dropout
    config: {name: dro_23, noise_shape: null, rate: 0.5, seed: null, trainable: true}
    inbound_nodes:
    - - - fc_2
        - 0
        - 0
        - {}
    name: dro_23
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: fc_3
      trainable: true
      units: 128
      use_bias: true
    inbound_nodes:
    - - - dro_23
        - 0
        - 0
        - {}
    name: fc_3
  - class_name: Dense
    config:
      activation: softmax
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: output
      trainable: true
      units: 6
      use_bias: true
    inbound_nodes:
    - - - fc_3
        - 0
        - 0
        - {}
    name: output
  name: model_1
  output_layers:
  - [output, 0, 0]
keras_version: 2.2.4
